{
  "sections": {
    "anesthesiology": {
      "description": "Management of pain and vital functions during medical procedures through various types of anesthesia.",
      "subsections": [
        {
          "name": "general_anesthesia",
          "description": "Induction of unconsciousness and loss of sensation during surgery using inhaled or intravenous agents."
        },
        {
          "name": "invasive_procedures",
          "description": "Anesthesia services associated with procedures involving significant tissue penetration or risk."
        },
        {
          "name": "monitoring_anesthesia_related",
          "description": "Continuous assessment of vital signs and anesthesia depth to ensure patient safety during procedures."
        },
        {
          "name": "obstetric_anesthesia",
          "description": "Pain relief techniques used during labor, delivery, and cesarean section."
        },
        {
          "name": "surgical_anesthesia_by_region",
          "description": "Regional techniques like spinal, epidural, or nerve blocks to anesthetize specific areas of the body."
        }
      ]
    },
    "dental": {
      "description": "Diagnostic, preventive, and corrective procedures related to oral and dental health.",
      "subsections": [
        {
          "name": "diagnostic_dental",
          "description": "Evaluation of oral health through clinical examination, radiographs, and diagnostic tools."
        },
        {
          "name": "preventive_dental",
          "description": "Procedures that help prevent dental issues, including cleanings, sealants, and fluoride treatments."
        },
        {
          "name": "restorative_dental",
          "description": "Treatments that restore function and appearance of teeth, such as fillings and crowns."
        },
        {
          "name": "oral_surgery",
          "description": "Surgical procedures in the oral cavity including extractions and corrective jaw surgeries."
        },
        {
          "name": "endodontics",
          "description": "Dental specialty focusing on root canal treatments and diseases of dental pulp."
        },
        {
          "name": "periodontics",
          "description": "Diagnosis and treatment of gum diseases and supporting structures of the teeth."
        },
        {
          "name": "prosthodontics",
          "description": "Design and fitting of artificial replacements for teeth and other parts of the mouth."
        },
        {
          "name": "orthodontics",
          "description": "Diagnosis and correction of misaligned teeth and jaws using braces and other appliances."
        }
      ]
    },
    "laboratory": {
      "description": "Analysis of body fluids and samples to support diagnosis, monitoring, and screening.",
      "subsections": [
        {
          "name": "chemistry",
          "description": "Includes general chemistry tests and specialized panels such as liver, renal, electrolyte, and enzyme analysis."
        },
        {
          "name": "hematology",
          "description": "Tests related to blood composition, including complete blood count, differential count, and coagulation studies."
        },
        {
          "name": "endocrinology",
          "description": "Hormonal analysis including thyroid, diabetes-related, and other hormone-level assessments."
        },
        {
          "name": "immunology",
          "description": "Assessment of immune function, including autoantibody detection, allergy panels, and general immune profiling."
        },
        {
          "name": "infectious_disease",
          "description": "Identification of pathogens including viral, bacterial, and parasitic agents."
        },
        {
          "name": "urine_based_testing",
          "description": "Analysis of urine specimens for urinalysis, microalbumin levels, and urinary electrolytes."
        },
        {
          "name": "nutritional_assessment",
          "description": "Evaluation of vitamin and mineral levels to detect deficiencies or nutritional imbalances."
        },
        {
          "name": "inflammatory_assays",
          "description": "Tests that measure inflammatory markers such as CRP, ESR, and calprotectin."
        },
        {
          "name": "specialized_panels",
          "description": "Advanced diagnostic panels including iron studies, metabolic profiles, and tumor markers."
        }
      ]
    },
    "specialty": {
      "description": "Non-surgical, organ-based clinical disciplines such as cardiology, neurology, and psychiatry.",
      "subsections": [
        {
          "name": "cardiology",
          "description": "Diagnosis and treatment of heart and cardiovascular conditions."
        },
        {
          "name": "pulmonology",
          "description": "Focus on lung and respiratory system disorders."
        },
        {
          "name": "neurology",
          "description": "Diagnosis and treatment of brain, spinal cord, and nervous system disorders."
        },
        {
          "name": "psychiatry",
          "description": "Assessment and management of mental health conditions and behavioral disorders."
        },
        {
          "name": "rehabilitation",
          "description": "Therapeutic interventions to restore function and mobility after illness or injury."
        },
        {
          "name": "urology",
          "description": "Management of urinary tract and male reproductive health conditions."
        },
        {
          "name": "ophthalmology",
          "description": "Medical and surgical care of the eyes and vision system."
        },
        {
          "name": "obstetrics_gynecology",
          "description": "Care related to female reproductive health, pregnancy, and childbirth."
        }
      ]
    },
    "pathology": {
      "description": "Microscopic and laboratory analysis of tissues, cells, and bodily fluids for disease diagnosis.",
      "subsections": [
        {
          "name": "histopathology",
          "description": "Examination of tissue samples under a microscope to study disease manifestations and cellular changes."
        },
        {
          "name": "cytopathology",
          "description": "Study of individual cell samples, typically for cancer diagnosis or infectious screening."
        },
        {
          "name": "molecular_pathology",
          "description": "Analysis of DNA, RNA, and proteins to detect genetic and molecular abnormalities in diseases."
        },
        {
          "name": "microbiology",
          "description": "Isolation and identification of microorganisms such as bacteria, fungi, and viruses in body specimens."
        },
        {
          "name": "blood_bank_transfusion",
          "description": "Testing, preparation, and provision of blood products for transfusion purposes."
        }
      ]
    },
    "imaging": {
      "description": "Diagnostic techniques that create visual representations of the internal structures of the body.",
      "subsections": [
        {
          "name": "xray",
          "description": "Imaging using X-rays to visualize bones, chest, and other dense structures."
        },
        {
          "name": "ultrasound",
          "description": "Diagnostic imaging using sound waves to create real-time images of internal organs, vessels, and fetuses."
        },
        {
          "name": "ct_scan",
          "description": "Cross-sectional imaging using computed tomography to provide detailed anatomical views."
        },
        {
          "name": "mri",
          "description": "Magnetic resonance imaging using magnetic fields and radio waves to produce detailed body images."
        },
        {
          "name": "nuclear_medicine",
          "description": "Imaging using small amounts of radioactive material to assess function and structure of organs."
        }
      ]
    },
    "procedures": {
      "description": "Invasive and non-invasive clinical interventions including surgical and therapeutic treatments.",
      "subsections": [
        {
          "name": "minor_clinical_procedures",
          "description": "Low-risk, outpatient procedures such as injections, wound care, and simple excisions."
        },
        {
          "name": "major_surgical_procedures",
          "description": "Invasive surgical operations typically requiring anesthesia and operating room facilities."
        },
        {
          "name": "laparo_endoscopic_procedures",
          "description": "Minimally invasive procedures using scopes such as laparoscopy and endoscopy."
        },
        {
          "name": "organ_targeted_procedures",
          "description": "Surgical interventions focused on specific organs like the kidney, liver, or gallbladder."
        },
        {
          "name": "vascular_interventions",
          "description": "Procedures addressing conditions of the arteries, veins, and circulatory system."
        },
        {
          "name": "musculoskeletal_surgery",
          "description": "Orthopedic procedures involving bones, joints, and connective tissue structures."
        },
        {
          "name": "neurosurgical_interventions",
          "description": "Surgeries performed on the brain, spine, or peripheral nervous system."
        },
        {
          "name": "therapeutic_non_surgical",
          "description": "Non-surgical treatments such as dialysis, radiation therapy, ESWL, and chemotherapy."
        },
        {
          "name": "reproductive_procedures",
          "description": "Procedures involving reproductive health, such as vasectomy and tubal ligation."
        }
      ]
    }
  }
}
